# digital_friend.py

'''
Привет! Хотелось бы что бы ты помогла дописать мне программу для создание виртуального друга. 
Нужно добавить вопросов нашему виртуальному другу, а так же выводить его ответы на экран.

"Сколько тебе лет? "
"Что ты любишь делать? "
И придумай еще возможно пару тройку вопросов, допиши код с выводом ответов на экран.
'''

# Подсказка по коду:
# name = input("Как тебя зовут? ")
# age = int(input("Сколько тебе лет? "))

# Твой код начинается здесь:

name = str(input("Как тебя зовут? ")) # STR = Строка
age = int(input("Сколько тебе лет? ")) # INT - Целое число
time = float(input('сколько сейчас времени')) # FLOAT 0.5, 1.5
hobby = bool(input('какое у тебя хобби')) # True, False Булево значение истина или ложь

print(name,age,time,hobby)

# Хорошая работа

